//TOGGLE help
$(".btn-help").click(function() {
    $(".help").toggle("fast", function() {
        // Animation complete.
    });
});
(function() {
	

	var today = new Date();
	var dd = today.getDate();
	var mm = today.getMonth()+1; //January is 0!
	var yyyy = today.getFullYear();
	
	
	var poetry = [];
	
	poetry[0] = "صاحب کو دل نہ دینے پہ کتنا غرور تھا";
	poetry[1] = "آہ کو چاہیئے اک عمر اثر ہوتے تک";
	poetry[2] = "بازیچۂ اطفال ہے دنیا مرے آگے";
	poetry[3] = "بس کہ دشوار ہے ہر کام کا آساں ہونا";
	poetry[4] = "درد منت کش دوا نہ ہوا";
	poetry[5] = "دل ناداں تجھے ہوا کیا ہے";
	poetry[6] = "ہیں اور بھی دنیا میں سخن ور بہت اچھے";
	poetry[7] = "ہم کو معلوم ہے جنت کی حقیقت لیکن";
	poetry[8] = "ہزاروں خواہشیں ایسی کہ ہر خواہش پہ دم نکلے";
	poetry[9] = "عشرت قطرہ ہے دریا میں فنا ہو جانا";
	poetry[10] = "کسی کو گھر سے نکلتے ہی مل گئی منزل";
	poetry[11] = "تم زمانے کے ہو ہمارے سوا";
	poetry[12] = "اب اور کیا کسی سے مراسم بڑھائیں ہم";
	poetry[13] = "اب کے ہم بچھڑے تو شاید کبھی خوابوں میں ملیں";
	poetry[14] = "دل بھی پاگل ہے کہ اس شخص سے وابستہ ہے";
	poetry[15] = "ہم کو اچھا نہیں لگتا کوئی ہم نام ترا";
	poetry[16] = "آئے تو یوں کہ جیسے ہمیشہ تھے مہربان";
	poetry[17] = "اور کیا دیکھنے کو باقی ہے";
	poetry[18] = "دل ناامید تو نہیں ناکام ہی تو ہے";
	poetry[19] = "گلوں میں رنگ بھرے باد نوبہار چلے";
	poetry[20] = "مقام فیضؔ کوئی راہ میں جچا ہی نہیں";
	poetry[21] = "عشق اک میرؔ بھاری پتھر ہے";
	poetry[22] = "یاد اس کی اتنی خوب نہیں میرؔ باز آ";
	poetry[23] = "آگ تھے ابتدائے عشق میں ہم";
	poetry[24] = "اب تو جاتے ہیں بت کدے سے میرؔ";
	poetry[25] = "رنجش ہی سہی دل ہی دکھانے کے لیے آ";

var poetr = [];
	
	poetr[0] = " آئینہ دیکھ اپنا سا منہ لے کے رہ گئے ";
	poetr[1] = "کون جیتا ہے تری زلف کے سر ہوتے تک";
	poetr[2] = "ہوتا ہے شب و روز تماشا مرے آگے";
	poetr[3] = "آدمی کو بھی میسر نہیں انساں ہونا";
	poetr[4] = "میں نہ اچھا ہوا برا نہ ہوا";
	poetr[5] = "آخر اس درد کی دوا کیا ہے";
	poetr[6] = "کہتے ہیں کہ غالبؔ کا ہے انداز بیاں اور";
	poetr[7] = "دل کے خوش رکھنے کو غالبؔ یہ خیال اچھا ہے";
	poetr[8] = "بہت نکلے مرے ارمان لیکن پھر بھی کم نکلے";
	poetr[9] = "درد کا حد سے گزرنا ہے دوا ہو جانا";
    poetr[10] = "کوئی ہماری طرح عمر بھر سفر میں رہا";
	poetr[11] = "ہم کسی کے نہیں تمہارے ہیں";
	poetr[12] = "یہ بھی بہت ہے تجھ کو اگر بھول جائیں ہم";
	poetr[13] = "جس طرح سوکھے ہوئے پھول کتابوں میں ملیں";
	poetr[14] = "جو کسی اور کا ہونے دے نہ اپنا رکھے";
	poetr[15] = "کوئی تجھ سا ہو تو نام بھی تجھ سا رکھے";
	poetr[16] = "بھولے تو یوں کہ گویا کبھی آشنا نہ تھے";
	poetr[17] = "آپ سے دل لگا کے دیکھ لیا";
	poetr[18] = "لمبی ہے غم کی شام مگر شام ہی تو ہے";
	poetr[19] = "چلے بھی آؤ کہ گلشن کا کاروبار چلے";
	poetr[20] = "جو کوئے یار سے نکلے تو سوئے دار چلے";
	poetr[21] = "کب یہ تجھ ناتواں سے اٹھتا ہے";
	poetr[22] = "نادان پھر وہ جی سے بھلایا نہ جائے گا";
	poetr[23] = "اب جو ہیں خاک انتہا ہے یہ";
	poetr[24] = "پھر ملیں گے اگر خدا لایا";
	poetr[25] = "آ پھر سے مجھے چھوڑ کے جانے کے لیے آ";

	var poet = [];
	
		poet[0] = 'مرزا غالب';
		poet[1] = 'مرزا غالب';
		poet[2] ='مرزا غالب';
		poet[3] = 'مرزا غالب';
		poet[4] = 'مرزا غالب';
		poet[5] = 'مرزا غالب';
		poet[6] = 'مرزا غالب';
		poet[7] = 'مرزا غالب';
		poet[8] = 'مرزا غالب';
		poet[9] = 'مرزا غالب';
    poet[10] = 'احمد فراز';
	poet[11] = 'مہتاب عالم';
	poet[12] = 'احمد فراز';
	poet[13] = 'احمد فراز';
	poet[14] = 'احمد فراز';
	poet[15] = 'احمد فراز';
	poet[16] = 'فیض احمد فیض';
	poet[17] = 'فیض احمد فیض';
	poet[18] = 'فیض احمد فیض';
	poet[19] = 'فیض احمد فیض';
	poet[20] = 'فیض احمد فیض';
	poet[21] = 'میر تقی میر';
	poet[22] = 'میر تقی میر';
	poet[23] = 'میر تقی میر';
	poet[24] = 'میر تقی میر';
	poet[25] = 'احمد فراز';

	var num = Math.floor(Math.random() * poetry.length);
	$('#poetr')
        .text( poetr[num] );
	$('#poetry')
        .text(poetry[num]);
			
	$('#poet')
        .html(' - ' + poet[num]);
		
	
	
})();