{
  "poetry": [
    [
      "صاحب کو دل نہ دینے پہ کتنا غرور تھا",
      " آئینہ دیکھ اپنا سا منہ لے کے رہ گئے ",
      "مرزا غالب"
    ],
    [
      "آہ کو چاہیئے اک عمر اثر ہوتے تک",
      "کون جیتا ہے تری زلف کے سر ہوتے تک",
      "مرزا غالب"
    ],
    [
      "بازیچۂ اطفال ہے دنیا مرے آگے",
      "ہوتا ہے شب و روز تماشا مرے آگے",
      "مرزا غالب"
    ],
    [
      "بس کہ دشوار ہے ہر کام کا آساں ہونا",
      "آدمی کو بھی میسر نہیں انساں ہونا",
      "مرزا غالب"
    ],
    [
      "درد منت کش دوا نہ ہوا",
      "میں نہ اچھا ہوا برا نہ ہوا",
      "مرزا غالب"
    ],
    [
      "دل ناداں تجھے ہوا کیا ہے",
      "آخر اس درد کی دوا کیا ہے",
      "مرزا غالب"
    ],
    [
      "ہیں اور بھی دنیا میں سخن ور بہت اچھے",
      "کہتے ہیں کہ غالبؔ کا ہے انداز بیاں اور",
      "مرزا غالب"
    ],
    [
      "ہم کو معلوم ہے جنت کی حقیقت لیکن",
      "دل کے خوش رکھنے کو غالبؔ یہ خیال اچھا ہے",
      "مرزا غالب"
    ],
    [
      "ہزاروں خواہشیں ایسی کہ ہر خواہش پہ دم نکلے",
      "بہت نکلے مرے ارمان لیکن پھر بھی کم نکلے",
      "مرزا غالب"
    ],
    [
      "عشرت قطرہ ہے دریا میں فنا ہو جانا",
      "درد کا حد سے گزرنا ہے دوا ہو جانا",
      "مرزا غالب"
    ],
    [
      "کسی کو گھر سے نکلتے ہی مل گئی منزل",
      "کوئی ہماری طرح عمر بھر سفر میں رہا",
      "احمد فراز"
    ],
    [
      "تم زمانے کے ہو ہمارے سوا",
      "ہم کسی کے نہیں تمہارے ہیں",
      "مہتاب عالم"
    ],
    [
      "اب اور کیا کسی سے مراسم بڑھائیں ہم",
      "یہ بھی بہت ہے تجھ کو اگر بھول جائیں ہم",
      "احمد فراز"
    ],
    [
      "اب کے ہم بچھڑے تو شاید کبھی خوابوں میں ملیں",
      "جس طرح سوکھے ہوئے پھول کتابوں میں ملیں",
      "احمد فراز"
    ],
    [
      "دل بھی پاگل ہے کہ اس شخص سے وابستہ ہے",
      "جو کسی اور کا ہونے دے نہ اپنا رکھے",
      "احمد فراز"
    ],
    [
      "ہم کو اچھا نہیں لگتا کوئی ہم نام ترا",
      "کوئی تجھ سا ہو تو نام بھی تجھ سا رکھے",
      "احمد فراز"
    ],
    [
      "آئے تو یوں کہ جیسے ہمیشہ تھے مہربان",
      "بھولے تو یوں کہ گویا کبھی آشنا نہ تھے",
      "فیض احمد فیض"
    ],
    [
      "اور کیا دیکھنے کو باقی ہے",
      "آپ سے دل لگا کے دیکھ لیا",
      "فیض احمد فیض"
    ],
    [
      "دل ناامید تو نہیں ناکام ہی تو ہے",
      "لمبی ہے غم کی شام مگر شام ہی تو ہے",
      "فیض احمد فیض"
    ],
    [
      "گلوں میں رنگ بھرے باد نوبہار چلے",
      "چلے بھی آؤ کہ گلشن کا کاروبار چلے",
      "فیض احمد فیض"
    ],
    [
      "مقام فیضؔ کوئی راہ میں جچا ہی نہیں",
      "جو کوئے یار سے نکلے تو سوئے دار چلے",
      "فیض احمد فیض"
    ],
    [
      "عشق اک میرؔ بھاری پتھر ہے",
      "کب یہ تجھ ناتواں سے اٹھتا ہے",
      "میر تقی میر"
    ],
    [
      "یاد اس کی اتنی خوب نہیں میرؔ باز آ",
      "نادان پھر وہ جی سے بھلایا نہ جائے گا",
      "میر تقی میر"
    ],
    [
      "آگ تھے ابتدائے عشق میں ہم",
      "اب جو ہیں خاک انتہا ہے یہ",
      "میر تقی میر"
    ],
    [
      "اب تو جاتے ہیں بت کدے سے میرؔ",
      "پھر ملیں گے اگر خدا لایا",
      "میر تقی میر"
    ],
    [
      "رنجش ہی سہی دل ہی دکھانے کے لیے آ",
      "آ پھر سے مجھے چھوڑ کے جانے کے لیے آ",
      "احمد فراز"
    ],
    [
      "گلا بھی تجھ سے بہت ہے مگر محبت بھی ",
      "وہ بات اپنی جگہ ہے یہ بات اپنی جگہ ",
      "باصر سلطان کاظمی"
    ],
    [
      "جب آ جاتی ہے دنیا گھوم پھر کر اپنے مرکز پر ",
      "تو واپس لوٹ کر گزرے زمانے کیوں نہیں آتے ",
      "عبرت مچھلی شہری"
    ]
  ]
}
